ChibiOS/ChibiOS/os/xhal/ports/STM32/LLD/ADCv3/hal_adc_lld.h
#if defined(STM32L4XX) || defined(STM32L4XXP) || defined(__DOXYGEN__)
/**
 * @brief   ADC1/ADC2/ADC3 clock source and mode.
 */
#if !defined(STM32_ADC_ADC123_CLOCK_MODE) || defined(__DOXYGEN__)
#define STM32_ADC_ADC123_CLOCK_MODE         ADC_CCR_CKMODE_AHB_DIV1
#endif

/**
 * @brief   ADC1/ADC2/ADC3 clock prescaler.
 */
#if !defined(STM32_ADC_ADC123_PRESC) || defined(__DOXYGEN__)
#define STM32_ADC_ADC123_PRESC              ADC_CCR_PRESC_DIV2
#endif
#endif /* defined(STM32L4XX) || defined(STM32L4XXP)  */

#if defined(STM32G4XX) || defined(__DOXYGEN__)
/**
 * @brief   ADC1/ADC2 clock source and mode.
 */
#if !defined(STM32_ADC_ADC12_CLOCK_MODE) || defined(__DOXYGEN__)
#define STM32_ADC_ADC12_CLOCK_MODE          ADC_CCR_CKMODE_AHB_DIV4
#endif

/**
 * @brief   ADC3/ADC4/ADC5 clock source and mode.
 */
#if !defined(STM32_ADC_ADC345_CLOCK_MODE) || defined(__DOXYGEN__)
#define STM32_ADC_ADC345_CLOCK_MODE         ADC_CCR_CKMODE_AHB_DIV4
#endif

/**
 * @brief   ADC1/ADC2 clock prescaler.
 */
#if !defined(STM32_ADC_ADC12_PRESC) || defined(__DOXYGEN__)
#define STM32_ADC_ADC12_PRESC               ADC_CCR_PRESC_DIV2
#endif

/**
 * @brief   ADC3/ADC4/ADC5 clock prescaler.
 */
#if !defined(STM32_ADC_ADC345_PRESC) || defined(__DOXYGEN__)
#define STM32_ADC_ADC345_PRESC              ADC_CCR_PRESC_DIV2
#endif
#endif /* defined(STM32G4XX) */

#if defined(STM32WBXX) || defined(__DOXYGEN__)
/**
 * @brief   ADC1 clock source and mode.
 */
#if !defined(STM32_ADC_ADC1_CLOCK_MODE) || defined(__DOXYGEN__)
#define STM32_ADC_ADC1_CLOCK_MODE           ADC_CCR_CKMODE_AHB_DIV1
#endif

/**
 * @brief   ADC1 clock prescaler.
 */
#if !defined(STM32_ADC_ADC1_PRESC) || defined(__DOXYGEN__)
#define STM32_ADC_ADC1_PRESC                ADC_CCR_PRESC_DIV2
#endif
#endif /* defined(STM32WBXX) */

/** @} */

/*===========================================================================*/
/* Derived constants and error checks.                                       */
/*===========================================================================*/

/* Supported devices checks.*/
#if !defined(STM32F3XX) && !defined(STM32L4XX) && !defined(STM32L4XXP) &&   \
    !defined(STM32G4XX) && !defined(STM32WBXX)
#error "ADCv3 only supports F3, L4, L4+, G4 and WB STM32 devices"
#endif

#if defined(STM32L4XX) || defined(STM32L4XXP) || defined(STM32G4XX) ||      \
    defined(STM32WBXX) || defined(__DOXYGEN__)
#define STM32_ADCV3_OVERSAMPLING            TRUE
#else
#define STM32_ADCV3_OVERSAMPLING            FALSE
#endif

/* Registry checks.*/
#if !defined(STM32_HAS_ADC1) || !defined(STM32_HAS_ADC2) ||                 \
    !defined(STM32_HAS_ADC3) || !defined(STM32_HAS_ADC4) ||                 \
    !defined(STM32_HAS_ADC5)
#error "STM32_HAS_ADCx not defined in registry"
#endif

#if (STM32_ADC_USE_ADC1 && !defined(STM32_ADC1_NUMBER)) ||                  \
    (STM32_ADC_USE_ADC2 && !defined(STM32_ADC2_NUMBER)) ||                  \
    (STM32_ADC_USE_ADC3 && !defined(STM32_ADC3_NUMBER)) ||                  \
    (STM32_ADC_USE_ADC4 && !defined(STM32_ADC4_NUMBER)) ||                  \
    (STM32_ADC_USE_ADC5 && !defined(STM32_ADC5_NUMBER))
#error "STM32_ADCx_NUMBER not defined in registry"
#endif

#if !STM32_DMA_SUPPORTS_DMAMUX
#if (STM32_ADC_USE_ADC1 && !defined(STM32_ADC1_DMA_MSK)) ||                 \
    (STM32_ADC_USE_ADC2 && !defined(STM32_ADC2_DMA_MSK)) ||                 \
    (STM32_ADC_USE_ADC3 && !defined(STM32_ADC3_DMA_MSK)) ||                 \
    (STM32_ADC_USE_ADC4 && !defined(STM32_ADC4_DMA_MSK)) ||                 \
    (STM32_ADC_USE_ADC5 && !defined(STM32_ADC5_DMA_MSK))
#error "STM32_ADCx_DMA_MSK not defined in registry"
#endif

#if (STM32_ADC_USE_ADC1 && !defined(STM32_ADC1_DMA_CHN)) ||                 \
    (STM32_ADC_USE_ADC2 && !defined(STM32_ADC2_DMA_CHN)) ||                 \
    (STM32_ADC_USE_ADC3 && !defined(STM32_ADC3_DMA_CHN)) ||                 \
    (STM32_ADC_USE_ADC4 && !defined(STM32_ADC4_DMA_CHN)) ||                 \
    (STM32_ADC_USE_ADC5 && !defined(STM32_ADC5_DMA_CHN))
#error "STM32_ADCx_DMA_CHN not defined in registry"
#endif
#endif /* !STM32_DMA_SUPPORTS_DMAMUX */

/* Units checks.*/
#if STM32_ADC_USE_ADC1 && !STM32_HAS_ADC1
#error "ADC1 not present in the selected device"
#endif

#if STM32_ADC_USE_ADC2 && !STM32_HAS_ADC2
#error "ADC2 not present in the selected device"
#endif

#if STM32_ADC_USE_ADC3 && !STM32_HAS_ADC3
#error "ADC3 not present in the selected device"
#endif

#if STM32_ADC_USE_ADC4 && !STM32_HAS_ADC4
#error "ADC4 not present in the selected device"
#endif

#if STM32_ADC_USE_ADC5 && !STM32_HAS_ADC5
#error "ADC5 not present in the selected device"
#endif

/* Units checks related to dual mode.*/
#if STM32_ADC_DUAL_MODE && STM32_ADC_USE_ADC1 && !STM32_HAS_ADC2
#error "ADC2 not present in the selected device, required for dual mode"
#endif

#if STM32_ADC_DUAL_MODE && STM32_ADC_USE_ADC3 && !STM32_HAS_ADC4
#error "ADC4 not present in the selected device, required for dual mode"
#endif

#if STM32_ADC_DUAL_MODE && STM32_ADC_USE_ADC2
#error "ADC2 cannot be used in dual mode"
#endif

#if STM32_ADC_DUAL_MODE && STM32_ADC_USE_ADC4
#error "ADC4 cannot be used in dual mode"
#endif

/* At least one ADC must be assigned.*/
#if !STM32_ADC_USE_ADC1 && !STM32_ADC_USE_ADC2 &&                           \
    !STM32_ADC_USE_ADC3 && !STM32_ADC_USE_ADC4 &&                           \
    !STM32_ADC_USE_ADC5
#error "ADC driver activated but no ADC peripheral assigned"
#endif

/* ISR arrangements checks.*/
#if STM32_HAS_ADC1 && STM32_HAS_ADC2
#if STM32_ADC1_NUMBER != STM32_ADC2_NUMBER
#error "ADCv3 driver expects STM32_ADC1_NUMBER == STM32_ADC2_NUMBER from registry"
#endif
#endif

/* IRQ priorities mapping.*/
#if STM32_HAS_ADC1 && STM32_HAS_ADC2
#define STM32_ADCV3_ADC1_IRQ_PRIORITY       STM32_IRQ_ADC1_2_PRIORITY
#define STM32_ADCV3_ADC2_IRQ_PRIORITY       STM32_IRQ_ADC1_2_PRIORITY
#else
#define STM32_ADCV3_ADC1_IRQ_PRIORITY       STM32_IRQ_ADC1_PRIORITY
#define STM32_ADCV3_ADC2_IRQ_PRIORITY       STM32_IRQ_ADC2_PRIORITY
#endif
#define STM32_ADCV3_ADC3_IRQ_PRIORITY       STM32_IRQ_ADC3_PRIORITY
#define STM32_ADCV3_ADC4_IRQ_PRIORITY       STM32_IRQ_ADC4_PRIORITY
#define STM32_ADCV3_ADC5_IRQ_PRIORITY       STM32_IRQ_ADC5_PRIORITY

/* ADC IRQ priority tests.*/
#if STM32_ADC_USE_ADC1 &&                                                   \
    !OSAL_IRQ_IS_VALID_PRIORITY(STM32_ADCV3_ADC1_IRQ_PRIORITY)
#error "Invalid IRQ priority assigned to ADC1"
#endif

#if STM32_ADC_USE_ADC2 &&                                                   \
    !OSAL_IRQ_IS_VALID_PRIORITY(STM32_ADCV3_ADC2_IRQ_PRIORITY)
#error "Invalid IRQ priority assigned to ADC2"
#endif

#if STM32_ADC_USE_ADC3 &&                                                   \
    !OSAL_IRQ_IS_VALID_PRIORITY(STM32_ADCV3_ADC3_IRQ_PRIORITY)
#error "Invalid IRQ priority assigned to ADC3"
#endif

#if STM32_ADC_USE_ADC4 &&                                                   \
    !OSAL_IRQ_IS_VALID_PRIORITY(STM32_ADCV3_ADC4_IRQ_PRIORITY)
#error "Invalid IRQ priority assigned to ADC4"
#endif

